Revit 2027 API
PanelScheduleData.NumberOfSlots Property
 The number of slots in the panel schedule; setting this value must go through the appropriate update function
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfSlots { get; }
Public ReadOnly Property NumberOfSlots As Integer
	Get
public:
property int NumberOfSlots {
	int get ();
}
member NumberOfSlots : int with get
Property Value
Int32
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace